app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "completed", "created_at", "updated_at", "due_date") VALUES (?, ?, ?, ?, ?)  [["title", "hello"], ["completed", nil], ["created_at", "2022-03-31 18:09:50.040177"], ["updated_at", "2022-03-31 18:09:50.040177"], ["due_date", nil]]

  def update
    @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "hello "], ["completed", 0], ["updated_at", "2022-03-31 18:10:08.945971"], ["id", 6]]

    def set_tasks
      @tasks = Task.all.order(due_date: :asc)
---
SELECT "tasks".* FROM "tasks" WHERE (due_date > '2022-04-01') ORDER BY "tasks"."due_date" ASC