app/controllers/tasks_controller.rb

    def set_tasks
      @tasks = Task.all.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC